In [1]:
## to replace or fill some values in Nan one's

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df["States"] = "Aus","Ind","Nz".split()
df.set_index("States",inplace=True)

In [4]:
df

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  NaN  2
[Nz]    NaN  NaN  3

In [5]:
df.fillna("ravi")

           A     B  C
States
Aus        1     5  1
Ind        2  ravi  2
[Nz]    ravi  ravi  3

In [6]:
df.fillna(2)

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  2.0  2
[Nz]    2.0  2.0  3

In [7]:
## to replace or fill some values in Nan one's
print("\n to fill the values with default values\n",'-'*45,sep=' ')
print(df.fillna(value='FILL VALUE'))

 to fill the values with default values
 ---------------------------------------------
                 A           B  C
States
Aus              1           5  1
Ind              2  FILL VALUE  2
[Nz]    FILL VALUE  FILL VALUE  3

In [8]:
df.fillna(value=df["A"].mean())

          A    B  C
States
Aus     1.0  5.0  1
Ind     2.0  1.5  2
[Nz]    1.5  1.5  3

In [9]:
## create Datframe

data = {'Company':["GOOG",'GOOG','MSFT','MSFT',"FB",'FB'],
        'Person':['Sam',"Mas","any","charlie","char","ravi"],
        'Sales':[100,200,300,400,124,210]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    100
1    GOOG      Mas    200
2    MSFT      any    300
3    MSFT  charlie    400
4      FB     char    124
5      FB     ravi    210

In [10]:
df.groupby("Company").mean()

         Sales
Company
FB         167
GOOG       150
MSFT       350

In [11]:
## groupby means if we will have similar kind of data then it will group the data based on condition
bycomp = df.groupby("Company")
print("\n grouping by 'company' column and listing mean sales\n",'-'*45,sep='  ')
print(bycomp.mean())

 grouping by 'company' column and listing mean sales
  ---------------------------------------------
         Sales
Company
FB         167
GOOG       150
MSFT       350

In [12]:
df.groupby("Company").describe()   ## only it will take numerical data

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  167.0  60.811183  124.0  145.5  167.0  188.5  210.0
GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0

In [13]:
df.groupby("Company").describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  167.0  60.811183  124.0  145.5  167.0  188.5  210.0
GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0

In [14]:
df.groupby("Company").describe().iloc[1:3,1:3]

         Sales
          mean        std
Company
GOOG     150.0  70.710678
MSFT     350.0  70.710678

In [15]:
df.groupby("Company").describe()["Sales"]

         count   mean        std    min    25%    50%    75%    max
Company
FB         2.0  167.0  60.811183  124.0  145.5  167.0  188.5  210.0
GOOG       2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MSFT       2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0

In [16]:
df.groupby("Company").describe()["Sales"].loc[["GOOG","MFST"],['mean',"std"]]

C:\Users\PC\Anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

          mean        std
Company
GOOG     150.0  70.710678
MFST       NaN        NaN

In [17]:
type(df.groupby("Company").describe())

pandas.core.frame.DataFrame

In [18]:
d = df.groupby("Company").describe()

In [19]:
df1 = d.transpose()

In [20]:
df1

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   167.000000  150.000000  350.000000
      std     60.811183   70.710678   70.710678
      min    124.000000  100.000000  300.000000
      25%    145.500000  125.000000  325.000000
      50%    167.000000  150.000000  350.000000
      75%    188.500000  175.000000  375.000000
      max    210.000000  200.000000  400.000000

In [21]:
d.T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   167.000000  150.000000  350.000000
      std     60.811183   70.710678   70.710678
      min    124.000000  100.000000  300.000000
      25%    145.500000  125.000000  325.000000
      50%    167.000000  150.000000  350.000000
      75%    188.500000  175.000000  375.000000
      max    210.000000  200.000000  400.000000

In [22]:
type(df1.loc["Sales"])

pandas.core.frame.DataFrame

In [23]:
df1.loc["Sales"].mean()

Company
FB      133.101398
GOOG    121.588835
MSFT    271.588835
dtype: float64

In [24]:
df.groupby("Company").describe().loc['GOOG']

Sales  count      2.000000
       mean     150.000000
       std       70.710678
       min      100.000000
       25%      125.000000
       50%      150.000000
       75%      175.000000
       max      200.000000
Name: GOOG, dtype: float64

In [25]:
type(df.groupby("Company").describe().loc['GOOG'])

pandas.core.series.Series

In [26]:
df.groupby("Company").describe().loc[['MSFT','GOOG']],['std']

(        Sales
         count   mean        std    min    25%    50%    75%    max
 Company
 MSFT      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
 GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0,
 ['std'])

In [27]:
## merging data frames
## Creating data frames
df1 = pd.DataFrame({"A":['A0','A1','A2','A3'],
                    "B":['B0','B1','B2','B3'],
                    "C":['C0','C1','C2','C3'],
                    "D":['D0','D1','D2','D3']},
                    index=[1,2,3,4])

In [28]:
df1

    A   B   C   D
1  A0  B0  C0  D0
2  A1  B1  C1  D1
3  A2  B2  C2  D2
4  A3  B3  C3  D3

In [29]:
df2 = pd.DataFrame({"A":['A4','A5','A6','A7'],
                    "B":['B4','B5','B6','B7'],
                    "C":['C4','C5','C6','C7'],
                    "D":['D4','D5','D6','D7']},
                    index=[5,6,7,8])

In [30]:
df2

    A   B   C   D
5  A4  B4  C4  D4
6  A5  B5  C5  D5
7  A6  B6  C6  D6
8  A7  B7  C7  D7

In [31]:
df3 = pd.DataFrame({"A":['A8','A9','A10','A11'],
                    "B":['B8','B9','B10','B11'],
                    "C":['C8','C9','C10','C11'],
                    "D":['D8','D9','D10','D11']},
                    index=[1,2,3,4])

In [32]:
df3

     A    B    C    D
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

In [33]:
## concatenation
df_cat1 = pd.concat([df1,df2,df3],axis=0)   ## axis = 0 means rows
print("\n After concatenating along row\n","-"*45,sep=' ')
print(df_cat1)

 After concatenating along row
 ---------------------------------------------
     A    B    C    D
1   A0   B0   C0   D0
2   A1   B1   C1   D1
3   A2   B2   C2   D2
4   A3   B3   C3   D3
5   A4   B4   C4   D4
6   A5   B5   C5   D5
7   A6   B6   C6   D6
8   A7   B7   C7   D7
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

In [34]:
df_cat1.loc[7]

A    A6
B    B6
C    C6
D    D6
Name: 7, dtype: object

In [35]:
df_cat1.iloc[0]

A    A0
B    B0
C    C0
D    D0
Name: 1, dtype: object

In [36]:
## concatenation
df_cat1 = pd.concat([df1,df2,df3],axis=1)   ## axis = 1 means columns
print("\n After concatenating along column\n","-"*45,sep=' ')
print(df_cat1)

 After concatenating along column
 ---------------------------------------------
     A    B    C    D    A    B    C    D    A    B    C    D
1   A0   B0   C0   D0  NaN  NaN  NaN  NaN   A8   B8   C8   D8
2   A1   B1   C1   D1  NaN  NaN  NaN  NaN   A9   B9   C9   D9
3   A2   B2   C2   D2  NaN  NaN  NaN  NaN  A10  B10  C10  D10
4   A3   B3   C3   D3  NaN  NaN  NaN  NaN  A11  B11  C11  D11
5  NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
8  NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN

In [37]:
df_cat2 = df_cat1.fillna(value=0,inplace=False)
print("\n After filling missing values with zero\n",'-'*45,sep=' ')
print(df_cat2)

 After filling missing values with zero
 ---------------------------------------------
    A   B   C   D   A   B   C   D    A    B    C    D
1  A0  B0  C0  D0   0   0   0   0   A8   B8   C8   D8
2  A1  B1  C1  D1   0   0   0   0   A9   B9   C9   D9
3  A2  B2  C2  D2   0   0   0   0  A10  B10  C10  D10
4  A3  B3  C3  D3   0   0   0   0  A11  B11  C11  D11
5   0   0   0   0  A4  B4  C4  D4    0    0    0    0
6   0   0   0   0  A5  B5  C5  D5    0    0    0    0
7   0   0   0   0  A6  B6  C6  D6    0    0    0    0
8   0   0   0   0  A7  B7  C7  D7    0    0    0    0

In [38]:
## merging by common key

In [39]:
left = pd.DataFrame({"key":['K0',"K8",'K2','K3'],
                     "A":['A0','A1','A2','A3'],
                     "B":['B0','B1','B2','B3']})

right = pd.DataFrame({"key":['K0',"K8",'K2','K3'],
                      "C":['C0','C1','C2','C3'],
                      "D":['D0',"D1",'D2','D3']})

In [40]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [41]:
right

  key   C   D
0  K0  C0  D0
1  K8  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [42]:
merge1 = pd.merge(left,right,how='inner',on="key")   ## how = inner based on common keys
print("\n After simple merging with 'inner' method\n",'-'*45,sep=" ")
print(merge1)

 After simple merging with 'inner' method
 ---------------------------------------------
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K8  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [43]:
import pandas as pd
df1 = pd.DataFrame({"key1":['K0',"K8",'K2','K3'],
                     "A":['A0','A1','A2','A3'],
                     "B":['B0','B1','B2','B3']})

df2 = pd.DataFrame({"key2":['K0',"K8",'K2','K3'],
                      "C":['C0','C1','C2','C3'],
                      "D":['D0',"D1",'D2','D3']})

In [44]:
df1

  key1   A   B
0   K0  A0  B0
1   K8  A1  B1
2   K2  A2  B2
3   K3  A3  B3

In [45]:
df2

  key2   C   D
0   K0  C0  D0
1   K8  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [46]:
pd.merge(df1,df2,how='left')

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [ ]:
pd.merge(df1,df2,how='left',left_on='key1',right_on='key2')

In [ ]:
## concatenation means it will concatinate based on the indexes merge means it will merge like inner,outer and so on

In [ ]:
## join operators : it is almost similar to merge

left = pd.DataFrame({"A":['A0','A1','A2'],
                     "B":['B0','B1',"B2"]},
                     index=["K0",'K1','K2'])

right = pd.DataFrame({"C":['C0','C1','C2'],
                      "D":['D0','D1','D2']},
                      index=['K0','K2','K3'])

In [ ]:
left

In [ ]:
right

In [ ]:
left.join(right)   ## index based gives join

In [ ]:
## create df1 = k,a,b,c df2 = k,b,c,d df3 = k,a,b,d

In [ ]:
df1 = pd.DataFrame({'key1':[1,23,45,56],
                    "B":[23,77,88,9],
                    "C":[12,33,5,7]})

In [ ]:
df2 = pd.DataFrame({'key2':[12,3,5,55],
                    "C":[23,7,8,19],
                    "D":[10,13,5,7]})

In [ ]:
df3 = pd.DataFrame({'key3':[1,23,45,56],
                    "B":[23,77,88,9],
                    "D":[12,33,5,7]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

In [ ]:
df_cat1 = pd.concat([df1,df2,df3],axis=1)   ## axis = 1 means columns
print("\n After concatenating along column\n","-"*45,sep=' ')
print(df_cat1)

In [ ]:
merge1 = pd.merge(df1,df2,how='outer',left_on="key1",right_on="key2")

In [ ]:
merge1

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   "col2":[444,555,666,777,555,444,333,222,111,123],
                   "col3": 'aaa b vv v cc d e f f h '.split()})

In [ ]:
df

In [ ]:
df["col10"] = df['col1']*10

In [ ]:
df

In [ ]:
import numpy as np
def testfunc(x):
    if x>500:
        return (10*np.log10(x))
    else:
        return x/10

In [ ]:
df["col2"].apply(testfunc)

In [ ]:
df["col20"] = df["col2"].apply(testfunc)

In [ ]:
df

In [ ]:
df['fun applied'] = df['col2'].apply(lambda x:np.log(x))

In [ ]:
df

In [ ]:
df['col3 length'] = df['col3'].apply(len)

In [ ]:
df

In [ ]:
test = df['fun applied'].apply(lambda x:np.sqrt(x))

In [ ]:
test

In [ ]:
df

In [ ]:
df['fun applied'].mean()

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/PramodShenoy/911-Calls/master/911.csv")

In [2]:
df

,lat,lng,desc,zip,title,timeStamp,twp,addr,e
0,40.297876,-75.581294,REINDEER CT & DEAD END; NEW HANOVER; Station ...,19525.0,EMS: BACK PAINS/INJURY,2015-12-10 17:40:00,NEW HANOVER,REINDEER CT & DEAD END,1
1,40.258061,-75.264680,BRIAR PATH & WHITEMARSH LN; HATFIELD TOWNSHIP...,19446.0,EMS: DIABETIC EMERGENCY,2015-12-10 17:40:00,HATFIELD TOWNSHIP,BRIAR PATH & WHITEMARSH LN,1
2,40.121182,-75.351975,HAWS AVE; NORRISTOWN; 2015-12-10 @ 14:39:21-St...,19401.0,Fire: GAS-ODOR/LEAK,2015-12-10 17:40:00,NORRISTOWN,HAWS AVE,1
3,40.116153,-75.343513,AIRY ST & SWEDE ST; NORRISTOWN; Station 308A;...,19401.0,EMS: CARDIAC EMERGENCY,2015-12-10 17:40:01,NORRISTOWN,AIRY ST & SWEDE ST,1
4,40.251492,-75.603350,CHERRYWOOD CT & DEAD END; LOWER POTTSGROVE; S...,NaN,EMS: DIZZINESS,2015-12-10 17:40:01,LOWER POTTSGROVE,CHERRYWOOD CT & DEAD END,1
...,...,...,...,...,...,...,...,...,...
99487,40.132869,-75.333515,MARKLEY ST & W LOGAN ST; NORRISTOWN; 2016-08-2...,19401.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:06:00,NORRISTOWN,MARKLEY ST & W LOGAN ST,1
99488,40.006974,-75.289080,LANCASTER AVE & RITTENHOUSE PL; LOWER MERION; ...,19003.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:07:02,LOWER MERION,LANCASTER AVE & RITTENHOUSE PL,1
99489,40.115429,-75.334679,CHESTNUT ST & WALNUT ST; NORRISTOWN; Station ...,19401.0,EMS: FALL VICTIM,2016-08-24 11:12:00,NORRISTOWN,CHESTNUT ST & WALNUT ST,1
99490,40.186431,-75.192555,WELSH RD & WEBSTER LN; HORSHAM; Station 352; ...,19002.0,EMS: NAUSEA/VOMITING,2016-08-24 11:17:01,HORSHAM,WELSH RD & WEBSTER LN,1
99491,40.207055,-75.317952,MORRIS RD & S BROAD ST; UPPER GWYNEDD; 2016-08...,19446.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:17:02,UPPER GWYNEDD,MORRIS RD & S BROAD ST,1

In [3]:
## description for categorical and numerical
## typecast lat into int and group and count
## try to tell how many people are from same zip location
## check timestamp data type and extract day in new column
## filter out all the zip code which address starts with 'a'
## try to map timestamp with day like mon,tue...............
## in title column extract service detail

In [4]:
## description for categorical and numerical
new_e = pd.Categorical(df["e"])

In [5]:
new_e

[1, 1, 1, 1, 1, ..., 1, 1, 1, 1, 1]
Length: 99492
Categories (1, int64): [1]

In [6]:
df.describe()

                lat           lng           zip        e
count  99492.000000  99492.000000  86637.000000  99492.0
mean      40.159526    -75.317464  19237.658298      1.0
std        0.094446      0.174826    345.344914      0.0
min       30.333596    -95.595595  17752.000000      1.0
25%       40.100423    -75.392104  19038.000000      1.0
50%       40.145223    -75.304667  19401.000000      1.0
75%       40.229008    -75.212513  19446.000000      1.0
max       41.167156    -74.995041  77316.000000      1.0

In [16]:
## typecast lat into int and group and count
df["lat"]

0        40.297876
1        40.258061
2        40.121182
3        40.116153
4        40.251492
           ...
99487    40.132869
99488    40.006974
99489    40.115429
99490    40.186431
99491    40.207055
Name: lat, Length: 99492, dtype: float64

In [19]:
## typecast lat into int and group and count
df["lat"] = df["lat"].astype(int)

In [20]:
df

,lat,lng,desc,zip,title,timeStamp,twp,addr,e
0,40,-75.581294,REINDEER CT & DEAD END; NEW HANOVER; Station ...,19525.0,EMS: BACK PAINS/INJURY,2015-12-10 17:40:00,NEW HANOVER,REINDEER CT & DEAD END,1
1,40,-75.264680,BRIAR PATH & WHITEMARSH LN; HATFIELD TOWNSHIP...,19446.0,EMS: DIABETIC EMERGENCY,2015-12-10 17:40:00,HATFIELD TOWNSHIP,BRIAR PATH & WHITEMARSH LN,1
2,40,-75.351975,HAWS AVE; NORRISTOWN; 2015-12-10 @ 14:39:21-St...,19401.0,Fire: GAS-ODOR/LEAK,2015-12-10 17:40:00,NORRISTOWN,HAWS AVE,1
3,40,-75.343513,AIRY ST & SWEDE ST; NORRISTOWN; Station 308A;...,19401.0,EMS: CARDIAC EMERGENCY,2015-12-10 17:40:01,NORRISTOWN,AIRY ST & SWEDE ST,1
4,40,-75.603350,CHERRYWOOD CT & DEAD END; LOWER POTTSGROVE; S...,NaN,EMS: DIZZINESS,2015-12-10 17:40:01,LOWER POTTSGROVE,CHERRYWOOD CT & DEAD END,1
...,...,...,...,...,...,...,...,...,...
99487,40,-75.333515,MARKLEY ST & W LOGAN ST; NORRISTOWN; 2016-08-2...,19401.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:06:00,NORRISTOWN,MARKLEY ST & W LOGAN ST,1
99488,40,-75.289080,LANCASTER AVE & RITTENHOUSE PL; LOWER MERION; ...,19003.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:07:02,LOWER MERION,LANCASTER AVE & RITTENHOUSE PL,1
99489,40,-75.334679,CHESTNUT ST & WALNUT ST; NORRISTOWN; Station ...,19401.0,EMS: FALL VICTIM,2016-08-24 11:12:00,NORRISTOWN,CHESTNUT ST & WALNUT ST,1
99490,40,-75.192555,WELSH RD & WEBSTER LN; HORSHAM; Station 352; ...,19002.0,EMS: NAUSEA/VOMITING,2016-08-24 11:17:01,HORSHAM,WELSH RD & WEBSTER LN,1
99491,40,-75.317952,MORRIS RD & S BROAD ST; UPPER GWYNEDD; 2016-08...,19446.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:17:02,UPPER GWYNEDD,MORRIS RD & S BROAD ST,1

In [21]:
df["lat"].count()

99492

In [24]:
df["lat"].groupby("zip",level=0)

In [25]:
df

,lat,lng,desc,zip,title,timeStamp,twp,addr,e
0,40,-75.581294,REINDEER CT & DEAD END; NEW HANOVER; Station ...,19525.0,EMS: BACK PAINS/INJURY,2015-12-10 17:40:00,NEW HANOVER,REINDEER CT & DEAD END,1
1,40,-75.264680,BRIAR PATH & WHITEMARSH LN; HATFIELD TOWNSHIP...,19446.0,EMS: DIABETIC EMERGENCY,2015-12-10 17:40:00,HATFIELD TOWNSHIP,BRIAR PATH & WHITEMARSH LN,1
2,40,-75.351975,HAWS AVE; NORRISTOWN; 2015-12-10 @ 14:39:21-St...,19401.0,Fire: GAS-ODOR/LEAK,2015-12-10 17:40:00,NORRISTOWN,HAWS AVE,1
3,40,-75.343513,AIRY ST & SWEDE ST; NORRISTOWN; Station 308A;...,19401.0,EMS: CARDIAC EMERGENCY,2015-12-10 17:40:01,NORRISTOWN,AIRY ST & SWEDE ST,1
4,40,-75.603350,CHERRYWOOD CT & DEAD END; LOWER POTTSGROVE; S...,NaN,EMS: DIZZINESS,2015-12-10 17:40:01,LOWER POTTSGROVE,CHERRYWOOD CT & DEAD END,1
...,...,...,...,...,...,...,...,...,...
99487,40,-75.333515,MARKLEY ST & W LOGAN ST; NORRISTOWN; 2016-08-2...,19401.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:06:00,NORRISTOWN,MARKLEY ST & W LOGAN ST,1
99488,40,-75.289080,LANCASTER AVE & RITTENHOUSE PL; LOWER MERION; ...,19003.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:07:02,LOWER MERION,LANCASTER AVE & RITTENHOUSE PL,1
99489,40,-75.334679,CHESTNUT ST & WALNUT ST; NORRISTOWN; Station ...,19401.0,EMS: FALL VICTIM,2016-08-24 11:12:00,NORRISTOWN,CHESTNUT ST & WALNUT ST,1
99490,40,-75.192555,WELSH RD & WEBSTER LN; HORSHAM; Station 352; ...,19002.0,EMS: NAUSEA/VOMITING,2016-08-24 11:17:01,HORSHAM,WELSH RD & WEBSTER LN,1
99491,40,-75.317952,MORRIS RD & S BROAD ST; UPPER GWYNEDD; 2016-08...,19446.0,Traffic: VEHICLE ACCIDENT -,2016-08-24 11:17:02,UPPER GWYNEDD,MORRIS RD & S BROAD ST,1

In [26]:
## try to tell how many people are from same zip location
df["zip"]

0        19525.0
1        19446.0
2        19401.0
3        19401.0
4            NaN
          ...
99487    19401.0
99488    19003.0
99489    19401.0
99490    19002.0
99491    19446.0
Name: zip, Length: 99492, dtype: float64

In [33]:
## check timestamp data type and extract day in new column
df["timeStamp"]

0        2015-12-10 17:40:00
1        2015-12-10 17:40:00
2        2015-12-10 17:40:00
3        2015-12-10 17:40:01
4        2015-12-10 17:40:01
                ...
99487    2016-08-24 11:06:00
99488    2016-08-24 11:07:02
99489    2016-08-24 11:12:00
99490    2016-08-24 11:17:01
99491    2016-08-24 11:17:02
Name: timeStamp, Length: 99492, dtype: object

In [34]:
type(df["timeStamp"])

pandas.core.series.Series

In [39]:
convert_timestamp = pd.DataFrame(df["timeStamp"])

In [45]:
 a = type(convert_timestamp)

In [46]:
a

pandas.core.frame.DataFrame

In [55]:
df["new_column"] = df["timeStamp"].astype('datetime64[ns]')
print(df.Date_time.dt.weekday_name.head())

0    Thursday
1    Thursday
2    Thursday
3    Thursday
4    Thursday
Name: Date_time, dtype: object

In [58]:
## filter out all the zip code which address starts with 'a'
df["addr"]

0                REINDEER CT & DEAD END
1            BRIAR PATH & WHITEMARSH LN
2                              HAWS AVE
3                    AIRY ST & SWEDE ST
4              CHERRYWOOD CT & DEAD END
                      ...
99487           MARKLEY ST & W LOGAN ST
99488    LANCASTER AVE & RITTENHOUSE PL
99489           CHESTNUT ST & WALNUT ST
99490             WELSH RD & WEBSTER LN
99491            MORRIS RD & S BROAD ST
Name: addr, Length: 99492, dtype: object

In [63]:
new_zip = type(df["addr"])

In [64]:
new_zip

pandas.core.series.Series

In [67]:
new_zip = df["addr"]

In [68]:
new_zip.str.startswith('A')

0        False
1        False
2        False
3         True
4        False
         ...
99487    False
99488    False
99489    False
99490    False
99491    False
Name: addr, Length: 99492, dtype: object

In [70]:
type(df["timeStamp"])

pandas.core.series.Series

In [71]:
## try to map timestamp with day like mon,tue...............
date = pd.DataFrame(df['timeStamp'])

In [72]:
date

                 timeStamp
0      2015-12-10 17:40:00
1      2015-12-10 17:40:00
2      2015-12-10 17:40:00
3      2015-12-10 17:40:01
4      2015-12-10 17:40:01
...                    ...
99487  2016-08-24 11:06:00
99488  2016-08-24 11:07:02
99489  2016-08-24 11:12:00
99490  2016-08-24 11:17:01
99491  2016-08-24 11:17:02

[99492 rows x 1 columns]

In [81]:
new_date = type(date)

In [82]:
new_date

pandas.core.frame.DataFrame

In [83]:
df.new_date.dt.weekday_name.head()

0    Thursday
1    Thursday
2    Thursday
3    Thursday
4    Thursday
Name: new_date, dtype: object

In [84]:
df.columns

Index(['lat', 'lng', 'desc', 'zip', 'title', 'timeStamp', 'twp', 'addr', 'e',
       'Date_time', 'new_date', 'convert_timestamp', 'a', 'new_column'],
      dtype='object')

In [86]:
df.head()

,lat,lng,desc,zip,title,timeStamp,twp,addr,e,Date_time,new_date,convert_timestamp,a,new_column
0,40,-75.581294,REINDEER CT & DEAD END; NEW HANOVER; Station ...,19525.0,EMS: BACK PAINS/INJURY,2015-12-10 17:40:00,NEW HANOVER,REINDEER CT & DEAD END,1,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00
1,40,-75.264680,BRIAR PATH & WHITEMARSH LN; HATFIELD TOWNSHIP...,19446.0,EMS: DIABETIC EMERGENCY,2015-12-10 17:40:00,HATFIELD TOWNSHIP,BRIAR PATH & WHITEMARSH LN,1,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00
2,40,-75.351975,HAWS AVE; NORRISTOWN; 2015-12-10 @ 14:39:21-St...,19401.0,Fire: GAS-ODOR/LEAK,2015-12-10 17:40:00,NORRISTOWN,HAWS AVE,1,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00,2015-12-10 17:40:00
3,40,-75.343513,AIRY ST & SWEDE ST; NORRISTOWN; Station 308A;...,19401.0,EMS: CARDIAC EMERGENCY,2015-12-10 17:40:01,NORRISTOWN,AIRY ST & SWEDE ST,1,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01
4,40,-75.603350,CHERRYWOOD CT & DEAD END; LOWER POTTSGROVE; S...,NaN,EMS: DIZZINESS,2015-12-10 17:40:01,LOWER POTTSGROVE,CHERRYWOOD CT & DEAD END,1,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01,2015-12-10 17:40:01

In [89]:
df["timeStamp"].dt.weekday_name()

AttributeError: Can only use .dt accessor with datetimelike values